.emacs.d/init.org
#+title: My emacs settings
#+auto_tangle: t

* Table of Contents :TOC:
- [[#config][Config]]
  - [[#early-init][Early Init]]
  - [[#setup-melpa][Setup MELPA]]
  - [[#setup-use-package][Setup use-package]]
  - [[#auto-tangle-config][Auto-tangle config]]
  - [[#y-or-n-instead-of-yes-or-no-prompts][Y or N instead of Yes or No prompts]]
  - [[#dont-show-warnings-only-errors][Don't show warnings, only errors]]
  - [[#disable-lock-files][Disable lock files]]
  - [[#emacs-directories][Emacs directories]]
  - [[#disable-backup-files][Disable backup files]]
  - [[#auto-save-files][Auto-save files]]
  - [[#customization-information-file][Customization information file]]
  - [[#benchmark-init][Benchmark init]]
  - [[#treat-underline-as-part-of-the-word][Treat underline as part of the word]]
  - [[#show-column-number-in-modeline][Show column number in modeline]]
  - [[#show-line-numbers][Show line numbers]]
  - [[#absolute-and-relative-line-numbers][Absolute and relative line numbers]]
  - [[#truncate-long-lines][Truncate long lines]]
  - [[#indent-using-4-spaces][Indent using 4 spaces]]
  - [[#refresh-buffers-on-change][Refresh buffers on change]]
  - [[#use-ibuffer-builtin-instead-of-list-buffers][Use =ibuffer= (builtin) instead of list-buffers.]]
  - [[#persist-minibuffers-history][Persist minibuffer's history]]
  - [[#display-date-time-and-battery-in-modeline][Display date, time and battery in modeline]]
  - [[#evil-mode---vim-mode-emulation][=evil-mode= - vim mode emulation]]
  - [[#evil-surround---surround-text-with-parenthesis-quotes-and-so-on][=evil-surround= - surround text with parenthesis, quotes, and so on]]
  - [[#key-chord---time-based-keymaps-for-evil][=key-chord= - time-based keymaps for evil]]
  - [[#hl-line-mode---highlight-current-line][=hl-line-mode= - highlight current line]]
  - [[#all-the-icons--all-the-icons-dired---icon-packages][=all-the-icons= + =all-the-icons-dired= - icon packages]]
  - [[#doom-themes---nice-themes][=doom-themes= - nice themes]]
  - [[#doom-modeline---nice-modeline][=doom-modeline= - nice modeline]]
  - [[#breadcrumb---summary-of-your-cursor-position][=breadcrumb= - summary of your cursor position]]
  - [[#flymake-builtin---syntax-checking][=flymake= (builtin) - syntax checking]]
  - [[#eletrict-pair-mode-builtin---auto-close-pairs-based-on-mode][=eletrict-pair-mode= (builtin) - auto close pairs based on mode]]
  - [[#projectel-builtin---managing-projects][=project.el= (builtin) - managing projects]]
  - [[#go-mode---go-support][=go-mode= - Go support]]
  - [[#go-tag---automatically-addingremoving-struct-tags][=go-tag= - automatically adding/removing struct tags]]
  - [[#nix-mode---nix-support][=nix-mode= - Nix support]]
  - [[#yaml-mode---yaml-support][=yaml-mode= - YAML support]]
  - [[#markdown-mode---markdown-support][=markdown-mode= - Markdown support]]
  - [[#python-mode-builtin---python-support][=python-mode= (builtin) - Python support]]
  - [[#nxml-mode-builtin---xml-support][=nxml-mode= (builtin) - XML support]]
  - [[#vue-mode---vue-support][=vue-mode= - Vue support]]
  - [[#c-mode-builtin---cc-support][=c-mode= (builtin) - C/C++ support]]
  - [[#eglot-builtin---lsp-client][=eglot= (builtin) - LSP client]]
  - [[#eldoc-builtin---showing-documentation-of-symbols][=eldoc= (builtin) - showing documentation of symbols]]
  - [[#eldoc-box---eldoc-in-a-box-below-cursor][=eldoc-box= - eldoc in a box below cursor]]
  - [[#corfu---completion-popup-like-vs-codes][=corfu= - completion popup like VS Code's]]
  - [[#envrc---direnv-integration][=envrc= - direnv integration]]
  - [[#recentf-mode---persistent-history-of-recent-files][=recentf-mode= - persistent history of recent files]]
  - [[#olivetti---horizontal-paddings-for-windows][=olivetti= - horizontal paddings for windows]]
  - [[#save-place-mode---save-cursor-position-per-file][=save-place-mode= - save cursor position per file]]
  - [[#consult---multiple-search-utilities][=consult= - multiple search utilities]]
  - [[#tab-line-builtin---show-buffers-as-tabs][=tab-line= (builtin) - show buffers as tabs]]
  - [[#tab-bar-builtin---tabs-like-vim][=tab-bar= (builtin) - tabs like vim]]
  - [[#whitespace-builtin---show-whitespaces-as-symbols][=whitespace= (builtin) - show whitespaces as symbols]]
  - [[#restclient---http-client][=restclient= - http client]]
  - [[#simple-httpd---static-http-server][=simple-httpd= - static http server]]
  - [[#winner-mode-builtin---undoredo-window-changes][=winner-mode= (builtin) - undo/redo window changes]]
  - [[#dired-builtin---file-manager][=dired= (builtin) - file manager]]
  - [[#dired-subtree---add-subt-tree-view-to-dired][=dired-subtree= - add subt tree view to dired]]
  - [[#magit---git-interface][=magit= - git interface]]
  - [[#diff-hl---highlight-uncommited-changes][=diff-hl= - highlight uncommited changes]]
  - [[#blamer-mode---git-blame-like-gitlens][=blamer-mode= - git blame like gitlens]]
  - [[#whick-key---suggests-key-combinations-as-you-press-them][=whick-key= - suggests key combinations as you press them.]]
  - [[#vterm---integrated-terminal][=vterm= - integrated terminal]]
  - [[#vertico---vertical-completion][=vertico= - vertical completion]]
  - [[#vertico-posframe---make-vertico-appear-as-a-floating-window][=vertico-posframe= - make vertico appear as a floating window]]
  - [[#marginalia---show-more-data-for-help-functions][=marginalia= - show more data for help functions]]
  - [[#orderless---fuzzy-completion][=orderless= - fuzzy completion]]
  - [[#auto-fill-mode-builtin---automatically-break-long-lines][=auto-fill-mode= (builtin) - automatically break long lines]]
  - [[#emms---music-player][=emms= - music player]]
  - [[#telega---telegram-client][=telega= - telegram client]]
  - [[#elfeed---client-for-atom-and-rss-feeds][=elfeed= - client for Atom and RSS feeds]]
  - [[#pdf-tools---read-pdfs-in-emacs][=pdf-tools= - read PDFs in emacs]]
  - [[#eww-builtin---simple-browser][=eww= (builtin) - simple browser]]
  - [[#activity-watch-mode---track-emacs-usage-using-activitywatch][=activity-watch-mode= - track emacs usage using ActivityWatch]]
- [[#org-config][Org Config]]
  - [[#org-directory][Org directory]]
  - [[#org-source-block---open-in-the-same-window][Org source block - open in the same window]]
  - [[#org-indirect-buffer---open-in-the-same-window][Org indirect buffer - open in the same window]]
  - [[#org-refile---save-all-buffers][Org refile - save all buffers]]
  - [[#org-priority---face-and-default-value][Org priority - face and default value]]
  - [[#org-tags---column][Org tags - column]]
  - [[#org-todos---keywords-and-state-logging][Org TODOs - keywords and state logging]]
  - [[#org-clock---keybindings][Org Clock - keybindings]]
  - [[#org-capture---templates][Org Capture - templates]]
  - [[#org-lists---replace---by--on-unordered-lists][Org lists - Replace ~-~ by ~•~ on unordered lists.]]
  - [[#org-agenda---setup-and-custom-views][Org Agenda - setup and custom views]]
  - [[#org-agenda---notifications-for-events][Org Agenda - notifications for events]]
  - [[#org-present---make-presentations-using-org-mode][=org-present= - make presentations using org mode]]
  - [[#org-drill---same-idea-as-anki][=org-drill= - same idea as Anki]]
  - [[#toc-org---generate-table-of-contents][=toc-org= - generate table of contents]]
  - [[#org-music---manage-songs-and-playlists-using-org][=org-music= - manage songs and playlists using org]]
  - [[#org-indent-mode-builtin---visually-indent-text-inside-headings][=org-indent-mode= (builtin) - visually indent text inside headings]]
  - [[#org-appear---show-emphasis-markers-when-cursor-is-over-the-word][=org-appear= - show emphasis markers when cursor is over the word.]]
  - [[#org-fragtog---display-latex-automatically-inside-org-buffers][=org-fragtog= - display LaTeX automatically inside org buffers]]
  - [[#org-roam---org-knowledge-management-system][=org-roam= - org knowledge management system]]
  - [[#org-roam-ui---visualize-org-roam-graph-in-real-time][=org-roam-ui= - visualize Org Roam graph in real time.]]

* Config
** Early Init

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+end_src

Hides startup message, scroll bar and tool bar.

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
#+end_src

No annoying bell sound nor flashing lights when something goes wrong.

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (blink-cursor-mode 0)
  (setq ring-bell-function 'ignore)
#+end_src

Set default theme before loading doom themes.

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  ;;(load-theme 'modus-vivendi)
#+end_src

Increase default font size.

#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el
  (set-face-attribute 'default nil :height 140)
#+end_src

#+property: header-args:emacs-lisp :tangle ~/.emacs.d/init.el

** COMMENT Frame

Launch in fullscreen.

#+begin_src emacs-lisp
  (toggle-frame-fullscreen)
#+end_src

** Setup MELPA

#+begin_src emacs-lisp
  (require 'package)
  (setq package-archives
        '(("gnu" . "https://elpa.gnu.org/packages/")
          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
          ("melpa" . "https://melpa.org/packages/")))
  (package-initialize)
#+end_src

** Setup use-package

#+begin_src emacs-lisp
  (eval-when-compile (require 'use-package))
  (setq use-package-always-ensure t)
#+end_src

** Auto-tangle config

Automatically generate =init.el= and =early-init.el= when I save this file.

#+begin_src emacs-lisp
  (use-package org-auto-tangle
    :defer
    :hook (org-mode . org-auto-tangle-mode))
#+end_src

** Y or N instead of Yes or No prompts

#+begin_src emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Don't show warnings, only errors

#+begin_src emacs-lisp
  (setq warning-minimum-level :error)
#+end_src

** Disable lock files

#+begin_src emacs-lisp
  (setq create-lockfiles nil)
#+end_src

** Emacs directories

#+begin_src emacs-lisp
  (setq user-emacs-directory "~/.emacs.d/")
#+end_src

** Disable backup files

#+begin_src emacs-lisp
  (setq make-backup-files nil)
#+end_src

** TODO Auto-save files

#+begin_src emacs-lisp
  (setq auto-save-file-name-transforms
    `((".*" "~/.cache/emacs/" t)))
#+end_src
** Customization information file

#+begin_src emacs-lisp
  (setq custom-file "~/.emacs.d/custom.el")
#+end_src

** COMMENT Escape to quit prompts

Press escape to quit most prompts.

#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Benchmark init

I was getting very bad startup times so I added this just to be sure.

#+begin_src emacs-lisp
  (use-package esup
    :defer
    :config
    (setq esup-depth 0))
#+end_src

** COMMENT General for keybindings

#+begin_src emacs-lisp
  (use-package general
    :config
    (general-create-definer general-leader
      :states ('normal 'visual)
      :keymaps 'override
      :prefix "SPC"))
#+end_src

** Treat underline as part of the word

#+begin_src emacs-lisp
  (use-package emacs
    :hook ((prog-mode
            text-mode
            conf-mode)
           . (lambda ()
               (modify-syntax-entry ?_ "w"))))
#+end_src

** Show column number in modeline

#+begin_src emacs-lisp
  (column-number-mode 1)
#+end_src

** Show line numbers

Enable line numbers for some modes.

#+begin_src emacs-lisp
  (use-package emacs
    :hook ((text-mode
            prog-mode
            conf-mode) . display-line-numbers-mode))
#+end_src

** Absolute and relative line numbers

Show absolute line numbers for insert state and relative for others.

#+begin_src emacs-lisp
  (use-package emacs
    :after evil
    :hook ((evil-insert-state-entry
            . (lambda ()
                (setq display-line-numbers-type t)
                (display-line-numbers-mode 1)))
           (evil-insert-state-exit
            . (lambda ()
                (setq display-line-numbers-type 'relative)
                (display-line-numbers-mode 1)))))
#+end_src

** Truncate long lines

#+begin_src emacs-lisp
  (set-default 'truncate-lines t)
#+end_src

** Indent using 4 spaces

#+begin_src emacs-lisp
  (setq-default tab-width 4)
  (setq-default indent-tabs-mode nil)
#+end_src

** Refresh buffers on change

Refreshs file automatically when its changed by other program.

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (global-auto-revert-mode 1))
#+end_src

** Use =ibuffer= (builtin) instead of list-buffers.

#+begin_src emacs-lisp
  (use-package emacs
    :bind ("C-x C-b" . ibuffer))
#+end_src

** Persist minibuffer's history

In ~M-x~, ~C-x C-f~ and so on.

#+begin_src emacs-lisp
  (savehist-mode 1)
  (setq history-length 100)
#+end_src

** Display date, time and battery in modeline

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (setq display-time-day-and-date t)
    (setq display-time-format "%a %H:%M %d/%m")
    (setq display-time-default-load-average nil)
    (display-time-mode 1)
    (display-battery-mode 1))
#+end_src

** =evil-mode= - vim mode emulation

evil mode and evil-collection provide vim-like bindings.

#+begin_src emacs-lisp
  (use-package evil
    :demand t
    :custom
    (evil-want-integration t)
    (evil-want-C-u-scroll t)
    (evil-want-keybinding nil) ; what? idk
    ;;(evil-want-minibuffer t)
    (evil-undo-system 'undo-redo)
    (evil-cross-lines t)
    :bind
    (:map evil-normal-state-map
          ("SPC u" . universal-argument)
          ("H" . previous-buffer)
          ("L" . next-buffer))
    :config
    (evil-set-leader 'normal (kbd "SPC"))
    (evil-mode 1))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src

** =evil-surround= - surround text with parenthesis, quotes, and so on

Works exactly like you-surround.

#+begin_src emacs-lisp
  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))
#+end_src

** =key-chord= - time-based keymaps for evil

I only use it to map ~jk~ to ~<Escape>~, aka switch to normal mode.

#+begin_src emacs-lisp
  (use-package key-chord
    :after evil
    :config
    (key-chord-mode 1)
    (setq key-chord-two-keys-delay 0.2)
    (key-chord-define evil-insert-state-map "jk" 'evil-normal-state))
#+end_src

** COMMENT =focus-mode= - highlight only the current area

#+begin_src emacs-lisp
  (use-package focus :defer)
#+end_src

** =hl-line-mode= - highlight current line

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (global-hl-line-mode 1))
#+end_src

** COMMENT =evil-mc= - multiple cursors like VSCode

#+begin_src emacs-lisp
  (use-package evil-mc :defer)
#+end_src

** =all-the-icons= + =all-the-icons-dired= - icon packages

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  ;; run once
  ;;(all-the-icons-install-fonts t)
  ;;(nerd-icons-install-fonts t)
#+end_src

** =doom-themes= - nice themes

#+begin_src emacs-lisp
  (use-package doom-themes
    :defer 0.3
    :config
    (setq doom-themes-enable-bold t)
    (setq doom-themes-enable-italic t)
    (load-theme 'doom-one t))
#+end_src

** =doom-modeline= - nice modeline

#+begin_src emacs-lisp
  (use-package doom-modeline
    :defer 1
    :config
    (setq doom-modeline-buffer-name nil)
    (setq doom-modeline-buffer-encoding nil)
    (doom-modeline-mode 1))
#+end_src

